'''
1. Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия.
Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.
'''


def salary(hours, pay_per_hour, bonus):
    return hours*pay_per_hour + bonus


print(salary(190, 1100, 10000))